app/controllers/genres_controller.rb

  def show
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "My edit"], ["updated_at", "2016-01-01 19:35:26.954064"], ["id", 1]]